#!E:\Software\Strawberry\perl\bin\perl.exe -w
use strict;
use warnings FATAL => 'all';
$| = 1; # 立即刷新缓冲区，直接输出

# ======================================================================================================================
# File Description
# 功能：入口例子
# 说明：入口小部件类似于文本小部件，可以在此部件中编辑或输入文本。文本小部件可让您输入多行文本，入口小部件只能输入一行文本。
# 作者：cucud
# 时间：2018/11/11 9:37
# ======================================================================================================================
use Tk;

my $mw = MainWindow->new;
$mw->geometry("200x100");
$mw->title("Entry Test");

$mw->Entry(-background => 'black', -foreground => 'white')->pack(-side => "top");
# 文本小部件和入口小部件的唯一差别在于小部件的名称：
# 但是，入口小部件仅能提供一行文本。
MainLoop;