#!E:\Software\Strawberry\perl\bin\perl.exe -w
use strict;
use warnings FATAL => 'all';
use v5.14;
$| = 1; # 立即刷新缓冲区，直接输出

# ======================================================================================================================
# File Description
# 功能：Perl简介
# 说明：Perl简介
# 作者：cucud
# 时间：2018/11/17 9:52
# ======================================================================================================================
# 默认写法：a:b:c:d:e:f:g
# while(<>) {
#     chomp;
#     print join("\t", (split/:/)[0,2,1,5]), "\n";
# }
# 全部用了默认变量

# print "Hello, world!\n";
#
# say "Hello, world!\n";
# ======================================================================================================================
my @lines = `perldoc -u -f atan2`;   # 反引号表示外部命令，把输出的每一行push到数组
foreach (@lines) {
    s/\w<([^>]+)>/\U$1/g;       # \w字母 \U全部大写
    print;
}
