#!E:\Software\Strawberry\perl\bin\perl.exe -w
use strict;
use warnings FATAL => 'all';
$| = 1; # 立即刷新缓冲区，直接输出

# ======================================================================================================================
# File Description
# 功能：用正则表达式匹配
# 说明：中级正则表达式
# 作者：cucud
# 时间：2018/11/12 22:52
# ======================================================================================================================
# /fred/ 是 m/fred/的简写
# 可以写成：m(fred)、m<fred>、m{fred}、m[fred]
# 甚至可以用其他不成对定界符（没有左右之分）：m,fred,、m!fred!、m^fred^
# 合理选择模式中不会出现的字符作为定界符：m%http://%
# 使用成对定界符的好处(由于是成对出现的)：m(fred(.*)barney)、m{\w{2,}}、m[wilma[\n\t]+betty]都没问题
# 但尖括号<>并非元字符，它们可能不会成对出现：如果模式没有成对出现<>，就要加上反斜线
# 技巧，程序员编辑器通常有从左括号到右括号的功能（相对称的括号）

