#!E:\Software\Strawberry\perl\bin\perl.exe
use v5.28; # 这个自动打开use strict;了！
use utf8;
use autodie; # open失败会自动启动die
use strict;
use warnings FATAL => 'all';
use diagnostics;     # 输出更详细warnings
my $ENCODE = "utf8"; # options: utf8 gbk
binmode(STDIN, ":encoding($ENCODE)");
binmode(STDOUT, ":encoding($ENCODE)");
binmode(STDERR, ":encoding($ENCODE)");
my $TRUE = !!'1';  # 表示真
my $FALSE = !!'0'; # 表示假
$| = 1;            # 立即刷新缓冲区，直接输出，会影响一些效率
$" = "|";          # 输出数组时的分隔符print "@array"; 默认为空格
# 子程序最后的计算表达式为返回值

# ======================================================================================================================
# File Description
# 功能：进阶正则表达式习题
# 说明：基本练习
# 作者：cucud
# 时间：2018/12/2 1:04
# ======================================================================================================================
# 匹配match字符串
say "习题一";
# while(<>){
#     chomp;
#     if(/match/){  # 这里用来测试某些模式
#         say "Matched: |$`<$&>$'|"; # 特殊捕获变量
#     } else {
#         say "No match: |$_|";
#     }
# }
# beforematchafter

# ======================================================================================================================
# 匹配以a结尾的单词
say "\n习题二";
# while(<>){
#     chomp;
#     if(/a\b/){  # 这里用来测试某些模式
#         say "Matched: |$`<$&>$'|"; # 特殊捕获变量
#     } else {
#         say "No match: |$_|";
#     }
# }
# wilma barney Mrs.WilmaFlintsone wilma&fred

# ======================================================================================================================
say "\n习题三";
# while(<>){
#     chomp;
#     if(/(\b\w*a\b)/){  # 其实第一个\b可以不写（性能更好）——由于*号的贪婪性。但是写上会更清晰。
#         say "Matched: |$`<$&>$'|"; # 特殊捕获变量
#         say "\$1 contains '$1'";
#     } else {
#         say "No match: |$_|";
#     }
# }
# \b的宽度为0，它只是表示宽度的边界
# wilma barney Mrs.WilmaFlintsone wilma&fred

# ======================================================================================================================
say "\n习题四";
# while(<>){
#     chomp;
#     if(/(?<word>\b\w*a\b)/){  # 其实第一个\b可以不写（性能更好）——由于*号的贪婪性。但是写上会更清晰。
#         say "Matched: |$`<$&>$'|"; # 特殊捕获变量
#         say "word contains '$+{word}'";
#     } else {
#         say "No match: |$_|";
#     }
# }
# wilma barney Mrs.WilmaFlintsone wilma&fred

# ======================================================================================================================
say "\n习题五";
# while(<>){
#     chomp;
#     if(m!
#         (\b\w*a\b)
#         (.{0,5})
#         !xs){  # 其实第一个\b可以不写（性能更好）——由于*号的贪婪性。但是写上会更清晰。
#         say "Matched: |$1 $2|"; # 特殊捕获变量
#     } else {
#         say "No match: |$_|";
#     }
# }
# I saw Wilma yesterday
# I,Wilma!
# wilma

# ======================================================================================================================
say "\n习题六";
while(<>) {
    chomp;
    if(/\s\z/) {
        say "$_#";
    }
}
# ======================================================================================================================

